<a href="https://colab.research.google.com/github/bhargavdhanisetti/AIML_NEOSKILLZ/blob/main/day_10_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
#CREATE TABLE students (
#id INT PRIMARY KEY,
#name VARCHAR(60),
#marks INT,
#City VARCHAR(50)
#);

#INSERT INTO students VALUES
#(1, ‘Atharv’, 70, ‘Mumbai’)
#(2, ‘Dhanraj’,89, ‘Sangli’)
#(3, ‘Shreya’, 85, ‘Thiruvananthapuram’)
#(4,’Laxmi’,45, ‘Delhi’)
#(5, ‘Harshika’, 99, ‘Mysore’);

#CREATE TABLE city_info(
#City VARCHAR(50),
#State VARCHAR(50),
#Pin code INT
#);

#INSERT INTO city_info VALUES
#('Mumbai', 'Maharashtra', 400067),
#('Sangli', 'Maharashtra', 416406),
#('Thiruvananthapuram', 'Kerala', 695001),
#('Mumbai', 'Maharashtra', 400031),
#('Mysore', 'Karnataka', 570002),
#('Pune', 'Maharashtra', 400000),
#('Delhi', 'Delhi', 500000),
#('Ahmedabad', 'Gujarat',306780);

#SELECT City, COUNT(name) AS Total
#from students
#GROUP BY City;

#SELECT City, COUNT(name) AS Total
#from students
#GROUP BY City
#HAVING COUNT(name)>1;

#SELECT name,  marks
#FROM students
#ORDER BY marks DESC
#LIMIT 2;



#SUBQUERY
#SELECT name, marks
#FROM students
#WHERE marks >(SELECT AVG(marks) from students)
#ORDER BY marks DESC
#LIMIT 2;

#●FUNCTIONS
#SELECT UPPER(name) from students;
#SELECT LOWER(name) from students;
#SELECT LENGTH(name) from students;
#SELECT SUBSTRING(name,1,4) from students;